app/Models/DetailModel.php

    public function getDetailById($id)
    {
        return $this->where('id', $id)->first();
---
SELECT *
FROM `detail`
WHERE `id` = '3'
 LIMIT 1