app/Models/OrderModel.php

SELECT *
FROM `order`
---
    public function getDetail()
    {
        return $this->findall();

SELECT *
FROM `order`
WHERE `id` IS NULL
 LIMIT 1
---
    public function getSpecific($id)
    {
        return $this->where('id', $id)->first();