app/Models/ProdukModel.php

    public function getAllProduk(){
        return $this->findAll();
---
SELECT *
FROM `produk`

    public function create($data){
        return $this->insert($data);
---
INSERT INTO `produk` (`nama`, `harga`, `deskripsi`) VALUES ('Honda NSX', '5000', 'Klasik')